tap "colindean/fonts-nonfree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "owenthereal/upterm"
brew "ansible"
brew "csvkit"
brew "diff-so-fancy"
brew "direnv"
brew "editorconfig"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "go"
brew "jq"
brew "mariadb"
brew "mysql-client"
brew "neovim"
brew "pwgen"
brew "the_silver_searcher"
brew "tmate"
brew "wget"
cask "brewservicesmenubar"
cask "copyclip"
cask "dbeaver-community"
cask "dropbox"
cask "firefox"
cask "font-microsoft-office"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keepingyouawake"
cask "libreoffice"
cask "meld"
cask "microsoft-teams"
cask "monitorcontrol"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sqlitemanager"
cask "thunderbird"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
