tap "aws/tap"
tap "colindean/fonts-nonfree"
tap "freecad/freecad"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "owenthereal/upterm"
tap "qmk/qmk"
tap "tylerbrock/saw"
brew "alerter"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "openssl@3"
brew "python@3.11"
brew "ansible@8"
brew "python@3.12"
brew "asciinema"
brew "glib"
brew "at-spi2-core"
brew "autopep8"
brew "boost"
brew "avrdude"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "boost-python3"
brew "llvm"
brew "ccls"
brew "eigen"
brew "gcc"
brew "suite-sparse"
brew "ceres-solver"
brew "cloc"
brew "cmake"
brew "python@3.10"
brew "pyside@2", link: true
brew "coin3d"
brew "gnu-sed"
brew "crosstool-ng"
brew "csvkit"
brew "ctags"
brew "libidn2"
brew "curl"
brew "cython"
brew "deno"
brew "desktop-file-utils"
brew "diff-so-fancy"
brew "direnv"
brew "docutils"
brew "dos2unix"
brew "harfbuzz"
brew "duck"
brew "editorconfig"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "fd"
brew "leptonica"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "numpy"
brew "openvino"
brew "flake8", link: false
brew "fsql"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-time"
brew "go"
brew "gping"
brew "node"
brew "graphql-cli"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "groonga"
brew "protobuf"
brew "grpc"
brew "grpcui"
brew "gtk+3"
brew "gtop"
brew "hdf5"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "leiningen"
brew "libffi"
brew "llvm@16"
brew "logcli"
brew "luarocks"
brew "mariadb", restart_service: true
brew "python@3.9"
brew "med-file@4.1.0", link: false
brew "mysql-client"
brew "neovim"
brew "neovide"
brew "netcdf"
brew "netlify-cli"
brew "nmap"
brew "nmrpflash"
brew "node@20"
brew "notmuch"
brew "opencascade"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "parallel"
brew "parquet-cli"
brew "pdfgrep"
brew "php"
brew "pillow", link: false
brew "pipx"
brew "platformio"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "psutils"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "pyqt@5"
brew "python-psutil"
brew "python-pytz", link: false
brew "python@3.8"
brew "pyyaml"
brew "r"
brew "rbenv"
brew "regina-rexx"
brew "ripgrep"
brew "rsync"
brew "ruby@3.1"
brew "rust"
brew "six"
brew "sphinx-doc"
brew "sponge"
brew "sqlparse"
brew "sshuttle"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tio"
brew "tmate"
brew "tmux"
brew "transmission-cli"
brew "trash"
brew "ttygif"
brew "typescript"
brew "uvicorn"
brew "virtualenv"
brew "vtk@8.2"
brew "west"
brew "wget"
brew "wimlib"
brew "xerces-c"
brew "yt-dlp"
brew "zig"
brew "freecad/freecad/med-file@4.1.1"
brew "freecad/freecad/nglib@6.2.2104"
brew "freecad/freecad/shiboken2@5.15.5"
brew "hudochenkov/sshpass/sshpass"
brew "qmk/qmk/qmk"
brew "tylerbrock/saw/saw"
cask "alacritty"
cask "arduino-ide"
cask "beersmith"
cask "brewservicesmenubar"
cask "cad-assistant"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "elmedia-player"
cask "firefox"
cask "font-microsoft-office"
cask "freecad"
cask "gdisk"
cask "gimp"
cask "google-chrome"
cask "handbrake"
cask "hex-fiend"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "keepingyouawake"
cask "keycastr"
cask "librecad"
cask "libreoffice"
cask "maccy"
cask "meld"
cask "monitorcontrol"
cask "ngrok"
cask "openscad"
cask "postman"
cask "prusaslicer"
cask "qmk-toolbox"
cask "rectangle"
cask "sequel-ace"
cask "slack"
cask "soapui"
cask "spotify"
cask "teamviewer"
cask "the-unarchiver"
cask "thunderbird"
cask "tinymediamanager"
cask "transmission"
cask "unetbootin"
cask "universal-media-server"
cask "vimr"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mohsen1.prettify-json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "platformio.platformio-ide"
vscode "vscodevim.vim"
